# 3)შექმენით ცვლადი სადაც შეინახავთ მომხმარებლის შემოყვანილ რიცხვს,თქვენი დავალებაა
#  1 დან მომხმარებლის შემოტანილი რიცხვის ჩათვლით გამოიტანოთ  ლუწი რიცხვების ჯამი 
# და კენტი რიცხვების რაოდენობა,შემდეგ  გაიგეთ ამ ორი რიცხვის(საბოლოო ჯამის და ს
# აბოლოო რაოდენობის) საშუალო არითმეტიკული
num = int(input())
def f(n):
    l = 0
    k = 0
    r = 0
    for i in range(1,n+1):
        if i%2 == 0:
            l += i
            r += 1
        else:
            k += 1
    return (l+k) / r

print(f(num))