# 6)შექმენით ფუნქცია რომელსაც გადასცემთ რიცხვებით სავსე სიას,თქვენი დავალებაა 
# შეამოწმოთ თუ ამ სიაში მყოფი რიცხვების საშუალო არითმეტიკული მეტია 20ზე მაგ
#  შემთხვევაში  0 დან მიღებული საშუალო არითმეტიკულამდე დაატრიალეთ ფორ ციკ
# ლი,შენი დავალებაა გაიგო ამ დიაპაზონში ლუწი რიცხვების რაოდენობა და კენტი რიც
# ხვების ჯამი,სხვა შემთხვევაში,დაითვალე 0 დან 
# საშუალო მიღებულ საშუვალო არითმეტიკულამდე და გამოიტანო თითეული რიცხვი
def f(list):
    s = 0
    l = 0 
    for i in list:
        s += i
        l += 1
    sas = s/l
    lw = 0
    kw = 0
    if sas >20:
        for g in range(0,sas+1):
            if g % 2 == 0:
                lw += 1
            else:
                kw += i
    else:
        b = 0
        while sas < 20:
            b += 1
            return b
    return kw , lw
print(f(12,61,617,51))