# 5)შექმენით ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული უნდა იყოს
#  სხვადასხვა მონაცემთა ტიპები,შენი დავალებაა გაიგო თუ ამ სიაში იმყოფება სტრინგი
# ,მაშინ ეს სტრინგი ჩაამატე ახალ სიაში,შემდეგ ეს სია სადაც შენახული გექნებათ სტრინგ
# ები გადმოიყვანოთ ერთ მთლიან სტრინგად და თითოეული ელემენტი ერთმანეთისგან დაშორებულ
# ი იყოს # ნიშნით,შემდეგ დაითვალეთ,თუ რამდენი # ეს ნიშანი გვხვდება ამმსტრინგში
def f(list):
    nl = []
    for i in list:
        if type(i) == str:
            nl.append(i)
    x = "#".join(nl) 
    count = 0
    for j in x:
        if j == "#":
            count += 1
    return count
print(f(["gabi",21,True,"goa",12.6]))