# 9)მომხმარებელს შემოატანინეთ ორი რიცხვი,
# თქვენი დავალებაა მოახდინოთ ყველა
#  მათემატიკური ოპერაცია ამ რიცხვებზე,
#  +,-./,//,*,==,%,ასევე კომენტარის სახით 
# ახსენით რას აკეთებს % ნიშანი (ვინც აქამდე ჩამოხვედით 
# და წინ რაც იყო ყ
# ველაფერი გააკეთეთ YOU ARE
#  REAL CHADS!RESPECT❤️❤️❤️
num1 = input("enter num1:")
num2 = input("enter num2:")
print(num1+num2)
# ამატებს
print(num1-num2)
# აკლებს
print(num1/num2)
# ყოფს
print(num1//num2)
# ყოფს და ბეჭდავს მთელს
print(num1*num2)
# ამრავლებს
print(num1==num2) 
# ერთმანეთს ატოლებს
print(num1%num2) 
# ნაშთს გვიბრუნებს