# 3)შექმენი ფუნქცია რომელსაც გადაეცემა სხვადასხვა მონაცემთა ტიპები,შენი დავლებაა სიიდან ა
# მოიღო მხოლოდ სტრინგ ტიპის მონაცემები რომლების სიგრძეც არის ნაკლები 5 ზე და იწყება 
# დიდი ასოთი და დაამატო ახალ სიაში,შემდეგ ეს სია დაასორტირე სიგრძის მიხედვით და შემო
# ატრიალეთ
listt = ["Gabrieli","luka",12,61,True,124.67]
def f(list):
    l = []
    for i in list:
        if type(i) == str and len(i) < 5 and i == i.capitalize():
            l.append(i)
    return l
print(sorted(listt,reverse=True,key=f ))