# 2)შექმენი ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება სხვადასხვა მონაცემთა
#  ტიპები,შენი დავალებაა რომ ამ სიიდან ამოიღო ინტეჯერებიდ ა მოათავსო ცალკე ახალ სიაში,ა
# სევე უნდა მაოიღო სტრინგებიც და ცალკე სიაში,შენი დავალებააა ეს ორი სია დაასორტირო,სტრინ
# გების სია დაასორტირე ანბანის მიხედვით და შემოატრიალე,და რიცხვების სია დაასორტირე ზრდადობის მიხედვით
def f(list):
    intl = []
    strl = []
    for i in list:
        if type(i) == int:
            intl.append(i)
        elif type(i) == str:
            strl.append(i)
    return sorted(intl) , sorted(strl, reverse=True)

print(f("gabo","luka",12,61,True,124.67))