# 4)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება როგორც სტრ
# ინგები ასევე ინტეჯერები,თქვენი დავალებაა სტრინგ ტიპის მონაცემები ჩაამატო ახალ
#  შექმნილ სიაში და დაასორტირო ანბანის მიხედვით,ხოლო ინტეჯერებიც ჩაამატე სხვა
#  ახალ სიაში და ეს საბოლოო სიაც დაასორტირე თან შემოატრიალე
list = [12,61,"Goa",15,"Gabi"]
def f(l):
    s = []
    g = []
    for i in list:
        if type(i) == str:
            s.append(i)
        else:
            g.append(i)
    return sorted(s,reverse=True) , sorted(g,reverse=True)
print(f(list))