# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება მხოლოდ რიცხვები და სტ
# რინგ ტიპის მონაცეემები,თქვენი დავალებაა რომ ამ სიიდან ამოიღოთ ინტეჯერ ტიპის მონაცემეები და დ
# აამატოთ ახალ სიაში,და ასევე უნდა ამოიღო სიიდან სტრინგ ტიპის მონაცემები და დაამატო ესეც სხვა 
# ახალ სიაში,თქვენი დავალებაა რომ რიცხვებით სავსე სია დაალაგოთ ზრდადიბის მიხედვით და სტრრი
# ნგების სია დაალაგოთ სიაში მოთავსებული სიტყვების სიგრძის მიხედვით
def f(list):
    lint = []
    lstr = []
    for i in list:
        if type(i) == int:
            lint.append(i)
        else:
            lstr.append(i)
    return sorted(lint),sorted(lstr , key=len)
print(f([123,51123,6113,61,13,"gabi","goa","giorgi"]))