# 2)შექმენით სია რომელსაც გადაეცემა  სახელი და გვარები მაგ --> ["გ
# ოგა ჩალაური" , "ანდრია შანავა" , "დათო მირიბიანი"] , თქვენი დ
# ავალებაა რომ ამ სიაში მყოფი ე;ემენტების სახელები მოათავსოთ სიაში რომელსაც ერქმევა nam
# es და გვარები მოათავსოთ სხვა სიაში რომელსაც ერქმევა surnames
ls = ["გოგა ჩალაური" , "ანდრია შანავა" , "დათო მირიბიანი"]
def f(list):
    names =[]
    surnames = []
    for i in list:
        names.append(i.split(" ")[0]) 
        surnames.append(i.split(" ")[1]) 
    return names ,surnames
print(f(ls))