# 10)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგებით
#  სავსე სია,შენი დავალებაა გაიგო,თუ ეს სიტყვა არის 
# capitalize მაგ შემთხვევაში დაამატა მსსგავსი სტრინგები
#  სხვა სიაში,თუ სიტყვა არის upper დაამატე ეს სტრინგი 
# სხვა ახალ სიაში,და თუ ეს სიტყვა არის lower მაშინ დაამატე
#  ეს სიტყვები სხვა ახალ სიაში,შემდეგ სამივე სიაში მოცემული
#  ელემენტები დააბრუნეთ ოღონდ სტრინგის სახით და
#  თითოეული სტრინგი ერთმანეთსგან დაშორებული იიყოს $ ნიშნით
def f(list):
    l1 = []
    l2 = []
    l3 = []
    for i in list:
        if i == i.capitalize():
            l1.append(i)
        elif i == i.upper():
            l2.append(i)
        elif i == i.lower():
            l3.append(i)
    s1 = "$".join(l1)
    s2 = "$".join(l2)
    s3 = "$".join(l3)
    return s1 +s2 +  s3
print(f(["Gabi", "Goa", "luka", "NIKA"]))