# 9)შექმენით ფუნქცია,რომელსაც გადაეცემა სტრინგებით სავსე სია,შენი დავალებაა
#  შეამოწმო,თუ სტრინგი შეიცავს კენტი რაოდენობის ასობგერას,მაგ შემთხვევაში 
# ჩაამატეთ ახალ სიაში,ხოლო თ შეიცავს ლუწი რაოდენობის ასობგერას შენი დავალებაა
#  ესენიც ჩაამატო ახალ სიაშ ოღნდ მათ ასოები იყოს დიდი
def f(list):
    nlist = []
    n1list= []
    for i in list:
        if len(i) % 2 != 0:
            nlist.append(i)
        else:
            n1list.append(i.upper())
    return n1list,nlist
print(f(["gabo","gio","luka"]))